Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/A18A.tmx
Source language: en_us
Languages: zh_cn

source: NASA Finds Smallest Earthlike Planet Outside Solar System
zh_cn: 美国国家航空航天局在太阳系外发现类地球行星

source: Rocky world 1.4 times Earth's size is "missing link " astronomer says.
zh_cn: 天文学家称这一大小为地球1.4倍的岩石星体正是（类地球行星研究中）“缺失的关键一环”。

source: The smallest planet yet spied outside our solar system has been found orbiting a sunlike star about 560 light-years away astronomers announced today.
zh_cn: 天文学家今日宣称，这颗名为开普勒10b号的行星是目前在太阳系外观测到的最小的环绕类太阳恒星运行的行星，距离我们约560光年。

source: Known as Kepler-10b the planet is just 1.4 times Earth's size and 4.6 times its mass.
zh_cn: 其大小为地球的1.4倍，质量为地球的4.6倍。

source: The planet found using NASA's Kepler spacecraft is the first of the more than 500 known exoplanets that's definitively rocky? much like Earth Mars Venus or Mercury? the study team says.
zh_cn: 研究小组称，这颗用美国国家航空航天局（NASA)的开普勒宇宙飞船发现的行星，是已知的500余颗外部行星中首颗确认的岩石星体――与地球、火星、金星或水星非常相似。

source: Launched in March 2009 Kepler was designed to hunt for potentially habitable Earthlike planets.
zh_cn: 开普勒号宇宙飞船在09年3月发射升空，其目的在于寻找潜在的可供人类居住的类地球行星。

source: Astronomers have been studying Kepler-10b since its discovery in 2009 when the team detected a periodic dimming of the host star as the planet passed in front of the star.
zh_cn: 天文学家自2009年发现开普勒10b号以来一直在对它进行研究，当时该研究小组探测到了该行星经过其主恒星前方时引起对方亮度的周期性减弱。

source: Finding such a small planet this way was no easy feat? seen from a similar distance Earthpassing in front of the sun would cause a 0.01 percent reduction in the star's brightness said Natalie Batalha of San Jose State University lead author of an upcoming paper describing the find.
zh_cn: 圣何塞州立大学的Natalie Batalha，即将发表的论述这一发现的论文主笔者：通过这一途径发现这样一颗小行星相当不易――从一个类似的距离观测，地球经过太阳正前方时，带给太阳的亮度衰减为0.01%。

source: "Imagine you have 10 000 light bulbs and you take one away. That's the change in brghtness we're looking for " Batalha said today during a meeting of the American Astronomical Society in Seattle Washington.
zh_cn: “想象一下，您从一万只同时亮着的灯泡中取走一支，这就是我们要找寻的亮度变化。”Batalla今天在华盛顿美国天文学会会议上这样说。

source: Still after using Kepler and other instruments to precisely calculate the new planet's size mass and density Batalha said "we know without question that this is a rocky world."
zh_cn: 在利用开普勒和其他仪器精确测量这颗新发现的行星的大小、质量和密度以后，Batahla说：“我们确定这是一颗岩石星体。”

source: Smallest Planet Has Density of Iron Before figuring out the nature of Kepler-10b the scientists looked at the host star's properties as revealed by starquakes acoustic disturbances that make the entire star ring like a bell.
zh_cn: 最小行星密度与铁相当 在研究开普勒10b号的属性之前，科学家们通过星震（使整个恒星像门铃一样震动的声波颤动），研究了主恒星的属性。

source: "In the same way that we use a sonogram to probe an unborn fetus and earthquakes to probe the interior of the Earth we use starquakes to probe the interior structure and properties of the star itself " Batalha said.
zh_cn: “如同用超声波做胎检，或者通过地震来探测地球内部，我们用声震来探测恒星的内部结构和属性”，Batalha说。

source: "A tiny star would yield different [vibration] frequencies than a large one just as when you strum a violin you're going to get a different sound than when you strum a cello." ?
zh_cn: 一颗小恒星会发出一大恒星不一样的颤动频率，这就好比你弹奏小提琴时会得到和大提琴不同的声音。

source: "Using starquakes Batalha and colleagues were able to accurately determine the size mass and age of the star which in turn allowed them to make very fine-tuned estimates of the new planet's characteristics.
zh_cn: 通过声震，Batalha及他的同事们能精确测定主恒星的大小、质量及其年龄，由此接下来他们就能精密测算行星的特性。

source: Astronomers carefully studied the tiny variations in starlight to determine Kepler-10b's size.
zh_cn: 天文学家们仔细研究星光的细微变化来确定开普勒10b号的大小。

source: The observations also revealed that the planet is very close to the star orbiting once every 20 hours.
zh_cn: 这些观测数据还显示，该行星离它的主恒星很近，每20小时绕其一周。

source: Using the W. M. Keck Observatory in Hawaii the Kepler team made precise measurements of minute shifts in the wavelengths of the host star's light.
zh_cn: 利用位于夏威夷的凯克天文台，开普勒研究小组精确测量了主恒星光波波长的细微变化。

source: This data showed how the star nodded back and forth in response to the planet's gravity allowing the team to calculate the masses of both objects.
zh_cn: 这一数据反应出主恒星受该行星重力影响而前后摆动的程度，据此他们计算出了两者的质量。

source: Based on this combined data the team concludes that Kepler-10b must be a rocky world with an average density of 8.8 grams per cubic centimeter? about the same as a chunk of iron.
zh_cn: 综合以上的数据，研究小组得出结论：开普勒10b号是一个均密度为8.8克每立方厘米的岩石星体，约与铁的密度相当。

source: Rocky World is "Planetary Missing Link" Being rocky however is no guarantee that a planet will be habitable.
zh_cn: 岩石星体，“行星研究中缺失的一环” 然而，岩石星体不意味着适合人类居住。

source: In the case of Kepler-10b one side of the planet always faces the star so that side would have a surface temperature of 2 500 degrees F (1 370 degrees C) Batalha estimates.
zh_cn: 就开普勒10b号来说，因其一侧总是面朝主恒星，那一侧的表面温度据Batalha估计将高达2500华度（即1370摄氏度）。

source: It's highly unlikely that such a world would retain an atmosphere since the searing hot gases would rapidly escape into space.
zh_cn: 这样一个星体不太可能有大气层，因为灼热的气体会飞快的向空中扩散。

source: Still Kepler-10b is an enormously important find said Geoffrey Marcy a planet hunter at the University of California Berkeley.
zh_cn: 无论如何，伯克利加州大学的“行星猎人”Geoffey Marcy认为开普勒10b号是一个至关重要的发现。

source: Marcy who is involved in the Kepler mission was not a core member of Batalha's team.
zh_cn: Marcy参与了开普勒行动，但不是Batalha小组的核心人成员。

source: "In astronomy we've been discovering giant gas planets for 15 years. But the ultimate goal is to discover habitable worlds like Earth " he said at the AAS meeting. ?
zh_cn: 在天文学上，我们15年来一直不断发现巨型气体行星，然而我们的终极目标是寻找像地球一样适合人类居住的世界。”Marcy在美国天文学会会议上说。

source: According to Marcy Kepler-10b is the "planetary missing link."
zh_cn: Marcy看来，开普勒10b号是“行星研究中缺失的关键一环”

source: "It's definitely not a gas giant like Jupiter. Nor is it habitable? it's too hot.
zh_cn: “它肯定不是像木星一样的巨型气体行星，也不适宜人类居住――那太热了。

source: This is a transitional planet somewhere between a gas giant and what we've been hoping to find."
zh_cn: 它是巨型气体行星与我们找寻的目标之间的一颗过渡性星体。

source: "One other possibly rocky planet COROT-7b might be even more Earthlike in size and mass Batalha agreed.
zh_cn: Batalha同意这个说法，她认为另一颗可能的岩石行星COROT-7b，很可能其大小和质量都与地球更为接近。

source: But its star is much more active with flares and other disturbances making it difficult to nail down important parameters with the needed precision.
zh_cn: 但是它的主行星要活跃得多，火焰和其它的干扰使得很难得到关于他的高精度的重要参数。

source: "For Kepler-10 we were lucky " she said.
zh_cn: “就开普勒10号而言，我们非常幸运。”

source: "It's a very quiet star."
zh_cn: 她说：“它非常安静。”
